# PANDAS

In [1]:
import numpy as np
import pandas as pd

#### DataFrame making into Pandas

In [2]:
dict1={
    "name" : ['tom','jerry','oggy','bob'],
    "age"  : [12,5,4,8],
    "address":['boston','london','delhi','paris']
}

In [3]:
df= pd.DataFrame(dict1)

In [4]:
df

    name  age address
0    tom   12  boston
1  jerry    5  london
2   oggy    4   delhi
3    bob    8   paris

#### DataFrame reading and writing  into csv

In [5]:
#to write an existing dataframe into csv file
df.to_csv("practice.csv")

To set index to false ->

In [6]:
df.to_csv("practice.csv",index=False)

To read from a csv file<br>
df1= pd.read_csv("your_file_path")

#### Head and Tail of a DataFrame

In [7]:
#if we want to see first 2 rows of a dataframe
df.head(2)

    name  age address
0    tom   12  boston
1  jerry    5  london

In [8]:
#if we want to see last 2 rows of a dataframe
df.tail(2)

   name  age address
2  oggy    4   delhi
3   bob    8   paris

#### To get 5 number summary of numeric column

In [9]:
df.describe()

             age
count   4.000000
mean    7.250000
std     3.593976
min     4.000000
25%     4.750000
50%     6.500000
75%     9.000000
max    12.000000

#### Updating a value in DataFrame

In [10]:
#To get the name column
df['name']

0      tom
1    jerry
2     oggy
3      bob
Name: name, dtype: object

In [11]:
#To get name of 2nd row
df['name'][1]

'jerry'

In [12]:
#To update this name #It will work though it is throwing an error
df['name'][1]='chutki'

C:\Users\SAYAN DEWANJEE\AppData\Local\Temp\ipykernel_4668\325394505.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['name'][1]='chutki'

In [13]:
df

     name  age address
0     tom   12  boston
1  chutki    5  london
2    oggy    4   delhi
3     bob    8   paris

#### To Change Index

In [14]:
df.index=["first","second","third",'fourth']
df

          name  age address
first      tom   12  boston
second  chutki    5  london
third     oggy    4   delhi
fourth     bob    8   paris

#### Series and Dataframes

In [15]:
#Making a series
ser=pd.Series(["ani","suvo","raju","sumit"])
ser1=pd.Series(np.random.rand(5))

In [16]:
ser

0      ani
1     suvo
2     raju
3    sumit
dtype: object

In [17]:
ser1

0    0.606877
1    0.885335
2    0.714429
3    0.561807
4    0.931833
dtype: float64

In [18]:
type(ser1)

pandas.core.series.Series

In [19]:
#Making a dataframe
daf=pd.DataFrame(np.random.rand(5,3))

In [20]:
daf

          0         1         2
0  0.349827  0.444269  0.253964
1  0.598837  0.565019  0.668900
2  0.035374  0.337848  0.613582
3  0.919545  0.578930  0.780783
4  0.548524  0.400367  0.528506

In [21]:
type(daf)

pandas.core.frame.DataFrame

In [22]:
#To find object types of column
daf.dtypes

0    float64
1    float64
2    float64
dtype: object

In a dataframe, every column contains same type of objects. Note here every column contains floating number. Now if we change one element of first column to string or some other thing, then type of this column will be 'OBJECT'.

In [23]:
daf[0][1]="mighty"

C:\Users\SAYAN DEWANJEE\AppData\Local\Temp\ipykernel_4668\1565559877.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  daf[0][1]="mighty"
C:\Users\SAYAN DEWANJEE\AppData\Local\Temp\ipykernel_4668\1565559877.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'mighty' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  daf[0][1]="mighty"

In [24]:
daf

          0         1         2
0  0.349827  0.444269  0.253964
1    mighty  0.565019  0.668900
2  0.035374  0.337848  0.613582
3  0.919545  0.578930  0.780783
4  0.548524  0.400367  0.528506

In [25]:
daf.dtypes

0     object
1    float64
2    float64
dtype: object

<h><b>#Seeing Index and columns of a dataframe</b></h>

In [26]:
daf.index #To see index

RangeIndex(start=0, stop=5, step=1)

In [27]:
daf.columns #To see columns

RangeIndex(start=0, stop=3, step=1)

In [28]:
df.columns #See the columns of our very first DataFrame

Index(['name', 'age', 'address'], dtype='object')

<h><b>#Changing into NumPy array</b></h>

In [29]:
df.to_numpy()

array([['tom', 12, 'boston'],
       ['chutki', 5, 'london'],
       ['oggy', 4, 'delhi'],
       ['bob', 8, 'paris']], dtype=object)

<h><b>#Taking transpose of DataFrame</b></h>

So column will be changed into index and index will be changed into column

In [30]:
df.T

          first  second  third fourth
name        tom  chutki   oggy    bob
age          12       5      4      8
address  boston  london  delhi  paris

<h><b>#Sorting a dataframe</h></b>

In [31]:
df.sort_index(axis=0,ascending=False)

          name  age address
third     oggy    4   delhi
second  chutki    5  london
fourth     bob    8   paris
first      tom   12  boston

If we do not provide ascending=False then it will take it as True in geenral. So now it returns our dataframe in reverse. And axis 0 determines sorting will be done rowwise and axis=1 determines sorting will be done columnwise.

In [32]:
df.sort_index(axis=1)

       address  age    name
first   boston   12     tom
second  london    5  chutki
third    delhi    4    oggy
fourth   paris    8     bob

#### Command to get some selected columns

In [33]:
df["age"] #to get the age column

first     12
second     5
third      4
fourth     8
Name: age, dtype: int64

In [34]:
df[["name","age"]] #to get the age and name column

          name  age
first      tom   12
second  chutki    5
third     oggy    4
fourth     bob    8

In [35]:
df[['name','age']][0:2] #we can get subset also

          name  age
first      tom   12
second  chutki    5

In [36]:
df[0:2]    #choosing first 2 rows

          name  age address
first      tom   12  boston
second  chutki    5  london

In [37]:
df[['name','age']]   #choosing first 2 columns

          name  age
first      tom   12
second  chutki    5
third     oggy    4
fourth     bob    8

To slice column now we will use 2 functions - iloc and loc

#### Using iLoc and Loc function

Using loc and iloc function helps us to filter and retrieve our dataset much efficiently. Loc refers to location indexing and ILoc refers to integer indexing.

##### Loc:
If we want to get some specific rows like row 0 and row 4 ,then we can not do it in previous manner. So we have to use it thorugh Loc function.

In [38]:
df.loc[["first","fourth"],["name","address"]]

       name address
first   tom  boston
fourth  bob   paris

In [39]:
daf.loc[[0,2,4],[1]]  #so first square bracket is dtermining row index and second square bracket determines column name

          1
0  0.444269
2  0.337848
4  0.400367

In [40]:
df.loc[:,['age']]  #to get all rows

        age
first    12
second    5
third     4
fourth    8

In [41]:
df.loc[["first","second","fourth"],:]   #to get all columns

          name  age address
first      tom   12  boston
second  chutki    5  london
fourth     bob    8   paris

##### ILoc: 
ILoc is same as Loc function. The differrence is Loc needs to row or column to operate whether Iloc needs their position.If we want to get first row we will provide 0 through ILoc function not that row index.Same for column- we will use 1 for second column instead of column name.

In [42]:
df.iloc[[0,1,3],:]  #getting  3 row

          name  age address
first      tom   12  boston
second  chutki    5  london
fourth     bob    8   paris

In [43]:
df.iloc[0:3,:]

          name  age address
first      tom   12  boston
second  chutki    5  london
third     oggy    4   delhi

In [44]:
df.iloc[[0,3],[0,2]]  #slicing dataframe

       name address
first   tom  boston
fourth  bob   paris

##### Basic query through pandas

Now we will make basic query through pandas.Let we want to get those rows where column 1 of dataframe daf has value less than 0.5.We will do this in following way :

In [45]:
daf.loc[(daf[1]<0.5)]             #Our query

          0         1         2
0  0.349827  0.444269  0.253964
2  0.035374  0.337848  0.613582
4  0.548524  0.400367  0.528506

Whta is happening here? Basically (daf[1]<0.5) returns a series of boolean value and then we pass it true daf.loc. And where true value ocurrs it returns that row.

In [46]:
(daf[1]<0.5)      #returning a series of boolean value

0     True
1    False
2     True
3    False
4     True
Name: 1, dtype: bool

In [47]:
daf.loc[[True,True,False,False,True]]           #searching and taking out those row

          0         1         2
0  0.349827  0.444269  0.253964
1    mighty  0.565019  0.668900
4  0.548524  0.400367  0.528506

##### Dropping column and rows

Now let we want to drop column 0 from our dataframe daf. The command is drop().

In [48]:
daf.drop([0])

          0         1         2
1    mighty  0.565019  0.668900
2  0.035374  0.337848  0.613582
3  0.919545  0.578930  0.780783
4  0.548524  0.400367  0.528506

But here we want to drop column 0 .So here we have to mention axis=1.

In [49]:
daf.drop([0],axis=1)

          1         2
0  0.444269  0.253964
1  0.565019  0.668900
2  0.337848  0.613582
3  0.578930  0.780783
4  0.400367  0.528506

Note this drop function does not alter daf dataframe. It just makes a copy. If we want to permanenttly store this we have to provide inplace=True

In [50]:
daf.drop([0],axis=1,inplace=True)

In [51]:
daf.head(2)            #note column 0 is removed

          1         2
0  0.444269  0.253964
1  0.565019  0.668900

In [52]:
df.drop(["name"],axis=1)

        age address
first    12  boston
second    5  london
third     4   delhi
fourth    8   paris

In [53]:
df.drop(["first",'third'])

          name  age address
second  chutki    5  london
fourth     bob    8   paris

##### Reset Index

Let we delete some rows and now we want to reset index from 0. So we have to use reset_index command.See in the following section

In [54]:
daf.drop([0,3],inplace=True)    #deleting rows

In [55]:
daf                              #printing daf

          1         2
1  0.565019  0.668900
2  0.337848  0.613582
4  0.400367  0.528506

In [56]:
daf.reset_index()                 #reseting index

   index         1         2
0      1  0.565019  0.668900
1      2  0.337848  0.613582
2      4  0.400367  0.528506

It is additionally shows another column index.Now we want to remove it.

In [57]:
daf.reset_index(drop=True,inplace=True)       #removing index column

In [58]:
daf                                          #printing new daf

          1         2
0  0.565019  0.668900
1  0.337848  0.613582
2  0.400367  0.528506